Repository: kolchyk/DarnitsaCashBot
Catalog: apps/telegram_bot/locales/*/LC_MESSAGES/bot.po
Languages: ru, uk

source: Share phone number
ru: Поделиться номером телефона
uk: Поділитися номером телефону

source: Hello, {name}! 👋
ru: Привет, {name}! 👋
uk: Привіт, {name}! 👋

source: Hello! 👋
ru: Привет! 👋
uk: Привіт! 👋

source: {greeting} Welcome to DarnitsaCashBot! 🎉 We will award bonuses for Darnitsa products. A receipt photo is required. Share your phone number so we can send 1₴ top-ups for each approved receipt. {consent}
uk: {greeting} Вітаємо в DarnitsaCashBot! 🎉 Ми нараховуємо бонуси за препарати Дарниця. Потрібне фото чека. Переконайтеся, що на чеку є QR код. Поділіться номером телефону, щоб ми могли надсилати поповнення 1₴ за кожен прийнятий чек. {consent}

source: Welcome to DarnitsaCashBot! Share your phone number so we can send 1₴ top-ups for each approved receipt. {consent}
uk: Вітаємо в DarnitsaCashBot! Ми нараховуємо бонуси за препарати Дарниця. Потрібне фото чека. Поділіться номером телефону, щоб ми могли нарахувати 1₴ за кожен прийнятий чек. {consent}

source: {greeting} Welcome back! We already have your phone number—just send a Darnitsa receipt photo to receive your next 1₴ top-up. {consent}
ru: {greeting} С возвращением! У нас уже есть ваш номер — просто отправьте фото чека Дарница, чтобы получить следующий бонус 1₴. Убедитесь, что на чеке есть QR код. {consent}
uk: {greeting} З поверненням! Ми вже маємо ваш номер — просто надішліть фото чека Дарниця, щоб отримати наступний бонус 1₴. Переконайтеся, що на чеку є QR код. {consent}

source: Welcome back! We already have your phone number—just send a Darnitsa receipt photo to receive your next 1₴ top-up. {consent}
ru: С возвращением! У нас уже есть ваш номер — просто отправьте фото чека Дарница, чтобы получить следующий бонус 1₴. {consent}
uk: З поверненням! Ми вже маємо ваш номер — просто надішліть фото чека Дарниця, щоб отримати наступний бонус 1₴. {consent}

source: Send a photo of a Darnitsa receipt to receive a 1₴ top-up. Use /history to see your past submissions or /change_phone to update your number.
ru: Отправьте фото чека с товарами Дарница и получите бонус 1₴. Убедитесь, что на чеке есть QR код. Используйте /history для истории и /change_phone для обновления номера.
uk: Надішліть фото чеку з продуктами Дарниця, щоб отримати бонус 1₴. Переконайтеся, що на чеку є QR код. Скористайтеся /history, щоб переглянути історію, або /change_phone для оновлення номера.

source: No receipts submitted yet.
ru: Вы ещё не отправляли чеки.
uk: Ще не надсилали жодного чеку.

source: Last {count} receipts:
ru: Последние {count} чеков:
uk: Останні {count} чеки:

source: We need your verified phone number to trigger payouts. Tap the button below to share it.
uk: Нам потрібен підтверджений номер телефону, щоб запустити виплати. Натисніть кнопку нижче, щоб поділитися ним.

source: Phone number saved. You can now send a receipt photo to get your 1₴ top-up. {consent}
ru: Номер сохранён. Теперь отправьте фото чека, чтобы получить бонус 1₴. Убедитесь, что на чеке есть QR код. {consent}
uk: Номер збережено. Тепер можете надіслати фото чека, щоб отримати бонус 1₴. Переконайтеся, що на чеку є QR код. {consent}

source: By sharing your contact you agree to the promo terms and privacy policy of Darnitsa.
ru: Отправляя контакт, вы соглашаетесь с правилами акции и политикой конфиденциальности Darnitsa.
uk: Поділяючи свої контактні дані, ви погоджуєтеся з умовами акції та політикою конфіденційності Darnitsa.

source: Receipt image exceeds 10MB. Please send a smaller file.
ru: Размер изображения больше 10 МБ. Пришлите более лёгкий файл.
uk: Зображення чека перевищує 10 МБ. Надішліть менший файл.

source: Processing your receipt...
ru: Обрабатываем ваш чек...
uk: Обробляємо ваш чек...

source: Receipt received. Current status: {status}
ru: Чек получен. Текущий статус: {status}
uk: Чек отримано. Поточний статус: {status}

source: Please send a receipt photo or use /help for guidance.
ru: Пришлите фото чека с QR кодом или используйте /help для подсказок.
uk: Надішліть фото чека з QR кодом або скористайтеся /help для інструкцій.

source: Receipt received. Payout will start after acceptance. Current status: {status}
uk: Чек отримано. Виплата почнеться після підтвердження. Поточний статус: {status}

source: Sorry, there was an error connecting to the server. Please try again later.
uk: Вибачте, сталася помилка під час з'єднання з сервером. Будь ласка, спробуйте пізніше.

source: pending
uk: очікує

source: processing
uk: обробляється

source: accepted
uk: прийнято

source: rejected
uk: відхилено

source: payout_pending
uk: очікує виплати

source: payout_success
uk: виплачено

source: payout_failed
uk: помилка виплати

source: {greeting} Welcome to DarnitsaCashBot! 🎉 Share your phone number so we can send 1₴ PortmoneDirect top-ups for each approved receipt. {consent}
ru: {greeting} Добро пожаловать в DarnitsaCashBot! 🎉 Мы начисляем бонусы за препараты Дарница. Нужно фото чека. Убедитесь, что на чеке есть QR код. Поделитесь номером телефона, чтобы мы могли отправлять пополнения PortmoneDirect на 1₴ за каждый принятый чек. {consent}

source: Welcome to DarnitsaCashBot! Share your phone number so we can send 1₴ PortmoneDirect top-ups for each approved receipt. {consent}
ru: Добро пожаловать в DarnitsaCashBot! Мы начисляем бонусы за препараты Дарница. Нужно фото чека. Убедитесь, что на чеке есть QR код. Поделитесь номером телефона, чтобы мы могли отправлять пополнения PortmoneDirect на 1₴ за каждый принятый чек. {consent}

source: We need your verified phone number to trigger PortmoneDirect payouts. Tap the button below to share it.
ru: Нам нужен подтверждённый номер телефона, чтобы запускать выплаты PortmoneDirect. Нажмите кнопку ниже, чтобы поделиться им.

source: Receipt received. PortmoneDirect payout will start after acceptance. Current status: {status}
ru: Чек получен. Выплата PortmoneDirect начнётся после подтверждения. Текущий статус: {status}

source: - {status} @ {uploaded_at} (Portmone bill: {reference}, payout: {payout_status})
ru: - {status} @ {uploaded_at} (Portmone: {reference}, статус: {payout_status})
